 
1. Вывести содержимое таблицы палат.
2. Вывести фамилии и телефоны всех врачей.
3. Вывести все этажи без повторений, на которых распола-
гаются палаты.
4. Вывести названия заболеваний под именем “Name of Disease”
и степень их тяжести под именем “Severity of Disease”.
5. Использовать выражение FROM для любых трех таблиц
базы данных, используя для них псевдонимы.
6. Вывести названия отделений, расположенных в корпусе
5 и имеющих фонд финансирования менее 30000.
7. Вывести названия отделений, расположенных в 3-м корпусе
с фондом финансирования в диапазоне от 12000 до 15000.
8. Вывести названия палат, расположенных в корпусах 4 и 5
на 1-м этаже.
9. Вывести названия, корпуса и фонды финансирования от-
делений, расположенных в корпусах 3 или 6 и имеющих
фонд финансирования меньше 11000 или больше 25000.
10. Вывести фамилии врачей, чья зарплата (сумма ставки
и надбавки) превышает 1500.
11. Вывести фамилии врачей, у которых половина зарплаты
превышает троекратную надбавку.
12. Вывести названия обследований без повторений, прово-
димых в первые три дня недели с 12:00 до 15:00.
1
Практическое задание No 3
13. Вывести названия и номера корпусов отделений, распо-
ложенных в корпусах 1, 3, 8 или 10.
14. Вывести названия заболеваний всех степеней тяжести,
кроме 1-й и 2-й.
15. Вывести названия отделений, которые не располагаются
в 1-м или 3-м корпусе.
16. Вывести названия отделений, которые располагаются в 1-м
или 3-м корпусе.
17. Вывести фамилии врачей, начинающиеся на букву “N”.
